app/controllers/api/v1/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "m.bthedon@yahoo.com"], ["LIMIT", 1]]
---
      def create
        params.require(:password)

        user = User.find_by(email: params.require(:email))