app/controllers/api/v1/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def index
        @post = Post.find(params[:post_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "all for one"], ["author_id", 1], ["post_id", 1], ["created_at", "2022-04-16 18:15:52.055147"], ["updated_at", "2022-04-16 18:15:52.055147"]]
---
      def create
        post = Post.find(params[:post_id])
        current_user = User.find(post.author_id)
        data = json_payload.select { |k| ALLOWED_DATA.include?(k) }
        comment = Comment.new(data)
        comment.update(author: current_user)
        comment.update(post:)

        if comment.save