app/controllers/api/v1/comments_controller.rb

      def index
        user = Comments.all
---
SELECT "comments".* FROM "comments"