app/controllers/api/v1/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def index
        hmac_secret = 'my$ecretK3y'

        token = params.require(:token)

        user = User.all
        #render json: user

        params.require(:token)

        decodes = JWT.decode token, hmac_secret, true, { algorithm: 'HS256' }

        ids = decodes[0]["user_id"]

        current_user = User.find(ids)