app/views/posts/index.html.erb


  <% @posts.includes(:comments).each_with_index do |n, idx| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

    <div class="borders">
      <% n.comments.each do |n| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]