app/views/posts/show.html.erb

      <p><%=@post_show.text%></p>
      <p>Comments: <%=@post_show.comments_counter%>, Likes: <%=@post_show.likes.count%></p>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]