app/controllers/comments_controller.rb

  def create
    current_post_id = params[:post_id]
    current_user_id = params[:user_id]

    comment = Comment.new(params.require(:comment_new).permit(:text))
    comment.update(author_id: current_user_id)
    comment.update(post_id: current_post_id)

    respond_to do |format|
      format.html do
        if comment.save
---
INSERT INTO "comments" ("text", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Testing testing testing"], ["author_id", 3], ["post_id", 15], ["created_at", "2022-04-13 16:38:05.815692"], ["updated_at", "2022-04-13 16:38:05.815692"]]

  def destroy
    @comment = current_user.comments.find(params[:id])
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]