app/controllers/likes_controller.rb

INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 3], ["created_at", "2022-04-08 16:17:49.549021"], ["updated_at", "2022-04-08 16:17:49.549021"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def create
    @like = current_user.likes.new(like_params)
    puts @like
    flash[:notice] = @like.errors.full_messages.to_sentence unless @like.save

    flash[:notice] = 'You have successfully liked this post.'
    redirect_to user_post_path(current_user, current_user.posts.find(like_params))

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 12]]
---
  def destroy
    @like_destroy = current_user.likes.find(params[:id])
    post = @like_destroy.post
    @like_destroy.destroy