app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
---
  def index
    @users = User.find_by(id: params[:user_id])
    @users = User.new if @users.nil?
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @post_show = Post.find_by(id: params[:id])
    @user_show = User.find_by(id: params[:user_id])

INSERT INTO "posts" ("author_id", "title", "text", "created_at", "updated_at", "comments_counter", "likes_counter") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    current_user_id = params[:user_id]

    post_create = Post.new(params.require(:posts).permit(:title, :text))
    post_create.update(author_id: current_user_id)
    respond_to do |format|
      format.html do
        if post_create.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 13]]
---
  def destroy
    @post = current_user.posts.find(params[:id])
    @post.destroy