app/controllers/users_controller.rb

  def show
    @user_show = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    post_create = Post.new(params.require(:user).permit(:author_id, :title, :text))

    respond_to do |format|
      format.html do

        if post_create.save
---
INSERT INTO "posts" ("author_id", "title", "text", "created_at", "updated_at", "comments_counter", "likes_counter") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"