app/models/comment.rb

  def update_post_comments_count
    if post.comments_counter == nil
      post.comments_counter = 1
    else
      post.increment!(:comments_counter)
---
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 21]]