app/models/like.rb

UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 3]]
---
  def update_post_likes_count
    post.increment!(:likes_counter)