app/models/post.rb

  def info(ids)
    Post.find_by(id: ids)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update_id(ids, idx)
    var = Post.find_by(id: ids)
    var.update(id: idx)
---
UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 1]]