app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def self.form_token_payload(payload)
    self.find payload["sub"]